## 📝 Terraform Plan Result:

```hcl
Acquiring state lock. This may take a few moments...
module.storage.random_integer.random: Refreshing state... [id=548]
module.storage.data.azurerm_client_config.current: Reading...
module.k8s.azurerm_resource_group.jumphost_rg: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/jumphost-rg]
module.network.azurerm_resource_group.network_rg: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/network-rg]
azurerm_resource_group.AKS_Cluster_RG: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/aks-cluster-rg]
module.storage.azurerm_resource_group.key_vault_rg: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/storage-rg]
module.storage.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wNGIwNzc5NS04ZGRiLTQ2MWEtYmJlZS0wMmY5ZTFiZjdiNDY7b2JqZWN0SWQ9N2I1OTgxODMtMjk1Ny00OTc1LTliNzMtYTc4MGFhZWUxOWY3O3N1YnNjcmlwdGlvbklkPWJjOTNmMDVjLTAyMmEtNGUyYi04NjIzLTcxM2VkNjEyZTFlOTt0ZW5hbnRJZD1jN2EwMmIyOC00MzU1LTRlZmEtODQzYi0yNDMxNjZhNWFiM2U=]
module.network.azurerm_public_ip.natgw_pip: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/network-rg/providers/Microsoft.Network/publicIPAddresses/nat-gateway-pip]
module.network.azurerm_public_ip.appgw_pip: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/network-rg/providers/Microsoft.Network/publicIPAddresses/app-gateway-pip]
module.network.azurerm_nat_gateway.natgw: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/network-rg/providers/Microsoft.Network/natGateways/aks-nat-gateway]
module.network.azurerm_private_dns_zone.acr_dns: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/network-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io]
module.network.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/network-rg/providers/Microsoft.Network/virtualNetworks/vnet-10.0.0.0_23]
module.k8s.azurerm_public_ip.bastion_pip: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/jumphost-rg/providers/Microsoft.Network/publicIPAddresses/bastionpip]
module.k8s.azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/aks-cluster-rg/providers/Microsoft.ContainerRegistry/registries/szymonctainerregistry01]
module.network.azurerm_nat_gateway_public_ip_association.natgw_pip_association: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/network-rg/providers/Microsoft.Network/natGateways/aks-nat-gateway|/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/network-rg/providers/Microsoft.Network/publicIPAddresses/nat-gateway-pip]
module.network.azurerm_subnet_nat_gateway_association.natgw_subnet_association: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/network-rg/providers/Microsoft.Network/virtualNetworks/vnet-10.0.0.0_23/subnets/aks-subnet-10.0.0.0_24]
module.k8s.azurerm_bastion_host.bastion: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/jumphost-rg/providers/Microsoft.Network/bastionHosts/bastion-host]
module.k8s.azurerm_network_interface.jumphost01-nic: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/jumphost-rg/providers/Microsoft.Network/networkInterfaces/jumphost01-nic]
module.network.azurerm_application_gateway.appgw: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/network-rg/providers/Microsoft.Network/applicationGateways/aks-app-gateway]
module.storage.azurerm_key_vault.akv: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/storage-rg/providers/Microsoft.KeyVault/vaults/azkeyvault548]
module.k8s.azurerm_private_endpoint.acr_pe: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/aks-cluster-rg/providers/Microsoft.Network/privateEndpoints/szymonctainerregistry01-pe]
module.k8s.azurerm_kubernetes_cluster.aks_cluster: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/aks-cluster-rg/providers/Microsoft.ContainerService/managedClusters/aks-szymon-cluster]
module.network.azurerm_private_dns_zone_virtual_network_link.acr_dns_link: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/network-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io/virtualNetworkLinks/acr-vnet-link]
module.k8s.azurerm_private_dns_a_record.acr_record: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/network-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io/A/szymonctainerregistry01]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.k8s.azurerm_kubernetes_cluster.aks_cluster will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "aks_cluster" {
        id                                  = "/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/aks-cluster-rg/providers/Microsoft.ContainerService/managedClusters/aks-szymon-cluster"
        name                                = "aks-szymon-cluster"
        tags                                = {}
        # (35 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {}
            # (30 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.k8s.azurerm_linux_virtual_machine.jumphost01 will be created
  + resource "azurerm_linux_virtual_machine" "jumphost01" {
      + admin_username                                         = "azureuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = true
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "northeurope"
      + max_bid_price                                          = -1
      + name                                                   = "jumphost01"
      + network_interface_ids                                  = [
          + "/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/jumphost-rg/providers/Microsoft.Network/networkInterfaces/jumphost01-nic",
        ]
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "jumphost-rg"
      + size                                                   = "Standard_B1s"
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false

      + admin_ssh_key {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # module.k8s.azurerm_role_assignment.aks_acr_assignment will be created
  + resource "azurerm_role_assignment" "aks_acr_assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3bdcd559-cb32-4c67-8a58-02aa17ae9c0b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/aks-cluster-rg/providers/Microsoft.ContainerRegistry/registries/szymonctainerregistry01"
      + skip_service_principal_aad_check = true
    }

  # module.storage.azurerm_key_vault.akv will be updated in-place
  ~ resource "azurerm_key_vault" "akv" {
      ~ access_policy                   = [
          ~ {
              ~ secret_permissions      = [
                    "Get",
                  + "Set",
                ]
                # (6 unchanged attributes hidden)
            },
        ]
        id                              = "/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/storage-rg/providers/Microsoft.KeyVault/vaults/azkeyvault548"
        name                            = "azkeyvault548"
        tags                            = {}
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.storage.azurerm_key_vault_secret.jumphost01_ssh_key will be created
  + resource "azurerm_key_vault_secret" "jumphost01_ssh_key" {
      + content_type            = "text/plain"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/storage-rg/providers/Microsoft.KeyVault/vaults/azkeyvault548"
      + name                    = "jumphost01-ssh-pubkey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 3 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```